asciiart-load-test.yml
config:
  target: http://asciiart.artillery.io:8080
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 10
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: Spike phase

scenarios:
  - name: Get 3 animal pictures
    flow:
      - loop:
          - get:
              url: "/dino"
          - get:
              url: "/pony"
          - get:
              url: "/armadillo"
        count: 100